Revit 2026 API

# FailureDefinitionAccessorSetDefaultResolutionType Method

---

Sets the default resolution type for the failure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetDefaultResolutionType(
	FailureResolutionType type
)
```
```vb
Public Sub SetDefaultResolutionType (
	type As FailureResolutionType
)
```
```cpp
public:
void SetDefaultResolutionType(
	FailureResolutionType type
)
```
```fsharp
member SetDefaultResolutionType :
        type : FailureResolutionType -> unit
```

#### Parameters

type FailureResolutionType
     The type of resolution to be used as default.

| Exception | Condition |
| --- | --- |
| ArgumentException | Resolution of the type is not applicable to the failure. |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| InvalidOperationException | The FailureDefinitionAccessor has not been properly initialized. -or- FailureDefinition does not have any resolutions. |

If failure has multiple resolutions, one of them is designated as designated as the default resolution. The default resolution is used by Revit failure processing mechanism to resolve failures automatically when applicable.

#### Reference

FailureDefinitionAccessor Class

Autodesk.Revit.DB Namespace